In [1]:
import pandas as pd
import numpy as np

In [5]:
df1 = pd.DataFrame({'emp':['Bob','Jake','Lisa','Sue'],
                    'group':['Accounting','Engineering','Engineering','HR']})

In [4]:
df2 = pd.DataFrame({'emp':['Lisa','Bob','Jake','Sue'],
                    'hire_date':[2004,2008,2012,2014]})

In [6]:
df1

    emp        group
0   Bob   Accounting
1  Jake  Engineering
2  Lisa  Engineering
3   Sue           HR

In [7]:
df2

    emp  hire_date
0  Lisa       2004
1   Bob       2008
2  Jake       2012
3   Sue       2014

In [8]:
df3 = pd.merge(df1,df2) '''one to one merge'''

In [9]:
df3

    emp        group  hire_date
0   Bob   Accounting       2008
1  Jake  Engineering       2012
2  Lisa  Engineering       2004
3   Sue           HR       2014

In [12]:
df4 = pd.DataFrame({'group':['Accounting', 'Engineering', 'HR'],
                   'Supervisor':['Carly','Guido','Steve']})

In [13]:
df4

  Supervisor        group
0      Carly   Accounting
1      Guido  Engineering
2      Steve           HR

In [14]:
df3.merge(df4) '''Many to one merge'''

    emp        group  hire_date Supervisor
0   Bob   Accounting       2008      Carly
1  Jake  Engineering       2012      Guido
2  Lisa  Engineering       2004      Guido
3   Sue           HR       2014      Steve

In [18]:
df5 = pd.DataFrame({'group':['Accounting','Accounting','Engineering','Engineering','HR','HR'],
                   'skills':['math','spreadsheets','coding','linux','spreadsheets','organisation']})

In [19]:
df5

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organisation

In [20]:
pd.merge(df1,df5) '''Many to many merging'''

    emp        group        skills
0   Bob   Accounting          math
1   Bob   Accounting  spreadsheets
2  Jake  Engineering        coding
3  Jake  Engineering         linux
4  Lisa  Engineering        coding
5  Lisa  Engineering         linux
6   Sue           HR  spreadsheets
7   Sue           HR  organisation

In [21]:
df1

    emp        group
0   Bob   Accounting
1  Jake  Engineering
2  Lisa  Engineering
3   Sue           HR

In [22]:
df2

    emp  hire_date
0  Lisa       2004
1   Bob       2008
2  Jake       2012
3   Sue       2014

In [23]:
pd.merge(df1,df2, on = 'emp') ''' Here we specify which is the column we can merge the data frames on'''

    emp        group  hire_date
0   Bob   Accounting       2008
1  Jake  Engineering       2012
2  Lisa  Engineering       2004
3   Sue           HR       2014

In [24]:
df3 = pd.DataFrame({'name':['Bob','Jake','Lisa','Sue'],
                   'salary':[70000,80000,120000,90000]})

In [25]:
df3

   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [26]:
df1

    emp        group
0   Bob   Accounting
1  Jake  Engineering
2  Lisa  Engineering
3   Sue           HR

In [28]:
pd.merge(df1,df3,left_on='emp',right_on = 'name')

    emp        group  name  salary
0   Bob   Accounting   Bob   70000
1  Jake  Engineering  Jake   80000
2  Lisa  Engineering  Lisa  120000
3   Sue           HR   Sue   90000

In [29]:
pd.merge(df1,df3,left_on='emp',right_on = 'name').drop('name',axis=1) '''conditional name and dropping a column'''

    emp        group  salary
0   Bob   Accounting   70000
1  Jake  Engineering   80000
2  Lisa  Engineering  120000
3   Sue           HR   90000

In [30]:
df1a = df1.set_index('emp')

In [31]:
df1a

            group
emp
Bob    Accounting
Jake  Engineering
Lisa  Engineering
Sue            HR

In [32]:
df2a = df2.set_index('emp')

In [33]:
df2a

      hire_date
emp
Lisa       2004
Bob        2008
Jake       2012
Sue        2014

In [34]:
pd.merge(df1a,df2a,left_index=True, right_index=True) ''' this is useful when multi index data needs to be merged'''

            group  hire_date
emp
Bob    Accounting       2008
Jake  Engineering       2012
Lisa  Engineering       2004
Sue            HR       2014

In [35]:
df1a.join(df2a) '''eqv to merge with multi index'''

            group  hire_date
emp
Bob    Accounting       2008
Jake  Engineering       2012
Lisa  Engineering       2004
Sue            HR       2014

In [36]:
df6 = pd.DataFrame({'name':['Peter','Paul','Mary'],
                    'food':['fish','beans','bread']}, columns = ['name','food'])

In [37]:
df7 = pd.DataFrame({'name':['Mary','Joseph'],
                    'drink':['wine','beer']}, columns = ['name','drink'])

In [39]:
df6

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread

In [40]:
df7

     name drink
0    Mary  wine
1  Joseph  beer

In [41]:
pd.merge(df6,df7)

   name   food drink
0  Mary  bread  wine

In [42]:
pd.merge(df6,df7,how="inner") ''' merges only the common items'''

   name   food drink
0  Mary  bread  wine

In [43]:
pd.merge(df6,df7,how="outer") ''' merges all the item whether it is common or not'''

     name   food drink
0   Peter   fish   NaN
1    Paul  beans   NaN
2    Mary  bread  wine
3  Joseph    NaN  beer

In [44]:
pd.merge(df6,df7,how='left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [45]:
pd.merge(df6,df7,how='right')

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

In [46]:
'''Inner : show only rows that are in both tables (so it will neer have Nan values)
   Outer : show all the rows in both table, if you can;t combine then introduce Nan
   left(right) : show all rows in the left (right ) table.
   this can take only 2 arguements'''

'Inner : show only rows that are in both tables (so it will neer have Nan values)\n   Outer : show all the rows in both table, if you can;t combine then introduce Nan\n   left(right) : show all rows in the left (right ) table.\n   this can take only 2 arguements'

In [57]:
df8 = pd.DataFrame({'name':['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank' : [1,2,3,4]})

In [58]:
df9 = pd.DataFrame({'name':['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank' : [3,1,4,2]})

In [59]:
pd.merge(df8,df9,on = 'name')

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [61]:
pd.merge(df8,df9, on='name',suffixes=['(class 1)', '(class 2)'])

   name  rank(class 1)  rank(class 2)
0   Bob              1              3
1  Jake              2              1
2  Lisa              3              4
3   Sue              4              2